import requests
import json
import csv
from bs4 import BeautifulSoup
import time 
from fake_useragent import UserAgent


cities = {
    '基隆市':['中正區', '七堵區', '暖暖區', '安樂區', '中山區', '仁愛區', '信義區'],
    '台北市':['松山區', '信義區', '大安區', '中山區', '中正區', '大同區', '萬華區', '文山區', '南港區', '內湖區', '士林區', '北投區' ],
    '新北市':['板橋區', '三重區', '中和區', '永和區', '新莊區', '新店區', '樹林區', '土城區', '蘆洲區', '汐止區', '鶯歌區', '三峽區', '淡水區', '瑞芳區', '五股區', '泰山區', '林口區', '深坑區', '石碇區', '坪林區', '三芝區', '石門區', '八里區', '平溪區', '雙溪區', '貢寮區', '金山區', '萬里區', '烏來區'],
    '桃園市':['桃園區', '中壢區', '八德區', '平鎮區', '龜山區', '大溪區', '楊梅區', '蘆竹區', '大園區', '龍潭區', '新屋區', '觀音區', '復興區'],
    '新竹市':['東區', '北區', '香山區'],
    '新竹縣':['竹北市', '竹東鎮', '新埔鎮', '關西鎮', '湖口鄉', '新豐鄉', '芎林鄉', '橫山鄉', '北埔鄉', '寶山鄉', '峨眉鄉'],
    '苗栗縣':['苗栗市', '竹南鎮', '後龍鎮', '頭份市', '造橋鄉', '三灣鄉', '頭屋鄉', '南庄鄉', '公館鄉', '西湖鄉', '通霄鎮', '苑裡鎮', '銅鑼鄉', '大湖鄉','三義鄉', '卓蘭鎮', '泰安鄉'],
    '台中市':['豐原區', '中區', '大里區', '東區', '南區', '太平區', '和平區', '西區', '北區', '東勢區', '后里區', '西屯區', '南屯區', '外埔區' , '南屯區', '北屯區', '大甲區', '大安區', '清水區', '神岡區', '石岡區', '新社區', '梧棲區', '沙鹿區', '大雅區', '潭子區', '龍井區', '大肚區', '烏日區', '霧峰區'],
    '彰化縣':['彰化市', '鹿港鎮', '伸港鄉', '線西鄉', '秀水鄉', '花壇鄉', '芬園鄉','福興鄉', '埔鹽鄉', '大村鄉', '員林市', '埔心鄉', '溪湖鎮', '芳苑鄉', '二林鎮', '埤頭鄉', '田尾鎮', '永靖鄉', '社頭鄉', '田中鎮', '北斗鎮','二水鄉', '溪州鄉', '竹塘鄉', '大城鄉', '和美鎮' ],
    '雲林縣':['斗六市', '斗南鎮', '虎尾鎮', '西螺鎮', '土庫鎮', '北港鎮', '口湖鄉', '麥寮鄉', '崙背鄉', '二崙鄉', '莿桐鄉', '林內鄉', '古坑鄉', '大埤鄉', '褒忠鄉', '元長鄉', '東勢鄉', '台西鄉', '四湖鄉', '水林鄉'],
    '南投縣':['南投市', '埔里鎮', '草屯鎮', '竹山鎮', '集集鎮', '名間鄉', '鹿谷鄉', '中寮鄉', '魚池鄉', '國姓鄉', '水里鄉', '信義鄉', '仁愛鄉'],
    '嘉義縣':['太保市', '朴子市', '布袋鎮', '大林鎮', '民雄鄉', '溪口鄉', '新港鄉', '六腳鄉', '東石鄉', '義竹鄉', '鹿草鄉', '水上鄉', '中埔鄉', '竹崎鄉', '梅山鄉', '番路鄉', '大埔鄉', '阿里山鄉'],
    '嘉義市':['東區', '西區'],
    '台南市':['新營區', '安南區', '安平區', '永康區', '北區', '白河區', '中西區', '鹽水區', '南區', '柳營區', '東區', '後璧區', '東山區', '北門區', '學甲區', '下營區', '六甲區', '楠西區', '將軍區', '佳里區', '麻豆區', '官田區', '大內區', '玉井區', '南化區', '七股區', '西港區', '安定區', '善化區', '新市區', '山上區', '新化區', '關廟區', '歸仁區', '仁德區'],
    '高雄市':['鳳山區', '鹽埕區', '鼓山區', '林園區', '大寮區', '左營區', '大樹區', '楠梓區', '三民區', '大社區', '新興區', '仁武區', '鳥松區', '前金區', '岡山區', '苓雅區', '橋頭區', '前鎮區', '燕巢區', '旗津區', '小港區', '阿蓮區', '路竹區', '茄萣區', '湖內區', '永安區', '彌陀區', '梓官區', '旗山區', '美濃區', '六龜區', '甲仙區', '杉林區', '內門區'],
    '屏東縣':['屏東市', '潮州鎮', '東港鎮', '恆春鎮', '萬丹鄉', '長治鄉', '麟洛鄉', '九如鄉', '里港鄉', '鹽埔鄉', '高樹鄉', '萬巒鄉', '內埔鄉', '竹田鄉', '新埤鄉', '枋寮鄉', '新園鄉', '崁頂鄉', '林邊鄉', '南州鄉', '佳冬鄉', '琉球鄉', '車城鄉', '滿州鄉', '枋山鄉', '三地門鄉', '春日鄉'],
    '台東縣':['台東市', '成功鎮', '關山鎮', '卑南鄉', '鹿野鄉', '池上鄉', '東河鄉', '長濱鄉', '太麻里鄉', '大武鄉', '綠島鄉', '達仁鄉', '蘭嶼鄉'],
    '花蓮縣':['花蓮市', '鳳林鎮', '玉里鎮', '新城鄉', '吉安鄉', '壽豐鄉', '光復鄉', '豐濱鄉', '瑞穗鄉', '富里鄉', '秀林鄉'],
    '宜蘭縣':['宜蘭市', '羅東鎮', '蘇澳鎮', '頭城鎮', '礁溪鄉', '壯圍鄉', '員山鄉', '冬山鄉', '五結鄉', '三星鄉', '大同鄉', '南澳鄉'],
    '連江縣':['南竿鄉', '北竿鄉', '東引鄉'],
    '金門縣':['金湖鎮', '金沙鎮', '金城鎮', '金寧鄉', '烈嶼鄉'],
    '澎湖縣':['馬公市', '湖西鄉', '白沙鄉', '西嶼鄉', '七美鄉'],
}

store_name = []
store_addr = []
store_px = []
store_py = []


url = "https://api.map.com.tw/net/familyShop.aspx?"
ua = UserAgent()
head = {"User-Agent":ua.random, "Referer":"https://www.family.com.tw/marketing/inquiry.aspx"}

for city, town in cities.items():
    for townlist in town:
        param ={
            "searchType": "ShopList",
            "type": "",
            "city": city,
            "area": townlist,
            "road": "",
            "fun": "showStoreList",
            "key": "6F30E8BF706D653965BDE302661D1241F8BE9EBC",
        }
        resp = requests.get(url, params=param, headers=head, timeout=5)
        print(resp.status_code)
        print(resp.url)
        #resp = resp.text.encode("utf-8").decode("unicode-escape")
        new_resp = resp.text.lstrip("showStoreList(").rstrip(")").replace("\n","").strip()
        #print(new_resp)
        #print(type(new_resp))

        data = json.loads(new_resp)
        #print(data)

        for row in data:
            store_name.append(row['NAME'])
            store_addr.append(row['addr'])
            store_px.append(row['px'])
            store_py.append(row['py'])
            time.sleep(1)
            print(store_name, store_addr, store_px, store_py)

with open('shoplist_全家.csv', 'w', newline='',  encoding="utf-8") as csvfile:
    csvwriter = csv.writer(csvfile, delimiter=',')
    newrow = ['門市名稱', '門市地址', 'X座標', 'y座標']
    csvwriter.writerow(newrow)
    for n in range(0, len(store_name)):
        newrow.clear()
        newrow.append(store_name[n])
        newrow.append(store_addr[n])
        newrow.append(store_px[n])
        newrow.append(store_py[n])
        csvwriter.writerow(newrow)
